Функция КодМодуля() Экспорт
	Возврат "e82032b3712745139fef8e08439582de";
КонецФункции

Функция ОписаниеМодуля() Экспорт
	Возврат "TextClassification";
КонецФункции

// Функция - Допустимые символы сообщений. Используется для фильтрации сообщений при приведении их к нормальной форме
// 
// Возвращаемое значение:
//   - 
//
Функция ДопустимыеСимволы() Экспорт
	Возврат "0123456789абвгдеёжзийклмнопрстуфхцчшщъыьэюяabcdefghijklmnopqrstuvwxyz";
КонецФункции

// Функция - Текст запроса чата сообщений ЛН (Справочник.СообщенияЧатаЗаявокНаЛН)
// 
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаЧатаСообщенийЛН() Экспорт
	Возврат
	"ВЫБРАТЬ
	|	спр.Сообщение КАК Сообщение,
	|	спр.КатегорияСообщения.ИмяПредопределенныхДанных КАК Категория
	|ИЗ
	|	Справочник.СообщенияЧатаЗаявокНаЛН КАК спр
	|ГДЕ
	|	спр.КатегорияСообщения <> ЗНАЧЕНИЕ(Справочник.КлассификацияТекста_Категории.)
	|	И спр.Сообщение <> """"
	|	И спр.ТипСообщения = ""Входящее""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	док.ТекстСообщения,
	|	док.КатегорияСообщения.ИмяПредопределенныхДанных
	|ИЗ
	|	Документ.ЗапросыНаИзменениеЛогистическогоИмени КАК док
	|ГДЕ
	|	док.КатегорияСообщения <> ЗНАЧЕНИЕ(Справочник.КлассификацияТекста_Категории.)
	|	И док.ТекстСообщения <> """"";
КонецФункции

// Функция - Получить наборы данных обучения, получает два текста для обучения модели Catboost.
//	Два набора получаются из одного общего набора, разбитых по соотношению ПроцентТеста. Например если ПроцентТеста = 20, значит от общего набора будет взято 20% для набора теста,
//	а 80% пойдет в набор обучения
// Параметры:
//  Классификатор	 - 	СправочникСсылка.КлассификацияТекста - ссылка на предопределенный элемент справочника
// 
// Возвращаемое значение:
//  Структура - структура с двумя элементами "Обучение" с текстом для обучения и "Тест" с текстом для теста
//
Функция ПолучитьНаборыДанныхОбучения(Классификатор, Лемматизация = Истина) Экспорт
	Если Классификатор = Справочники.КлассификацияТекста.СообщенияЧатаЗаявокНаЛН Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаЧатаСообщенийЛН();
	Иначе
		ВызватьИсключение "Набор данных возможно получить только для предопределенного элемента справочника КлассификацияТекста, т.к. необходимо программирование под каждый кейс";
	КонецЕсли;
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Сообщение");
	ТЗ.Колонки.Добавить("Категория");
	ТЗ.Колонки.Добавить("ИдентификаторХаоса"); //нужен для случайного порядка
	Данные = Запрос.Выполнить().Выгрузить();
	СтатистикаКатегорий = Новый Соответствие;
	//сначала получить все сообщения с категориями
	МассивТекстов = Данные.ВыгрузитьКолонку("Сообщение");
	СтопСлова = СтрРазделить(Классификатор.СтопСлова, Символы.ПС);
	МассивНормальныхФорм = НормальныеФормыТекстов(МассивТекстов, СтопСлова, Лемматизация);
	Для Сч = 0 по Данные.Количество()-1 Цикл
		Сообщение = МассивНормальныхФорм[Сч];
		СтрокаДанных = Данные[Сч];
		Если ТЗ.Найти(Сообщение, "Сообщение") = Неопределено Тогда
			НоваяСтрока = ТЗ.Добавить();
			НоваяСтрока.Сообщение = Сообщение;
			НоваяСтрока.Категория = СтрокаДанных.Категория;
			НоваяСтрока.ИдентификаторХаоса = Строка(Новый УникальныйИдентификатор);
			КоличествоКатегории = СтатистикаКатегорий.Получить(СтрокаДанных.Категория);
			Если КоличествоКатегории = Неопределено Тогда
				КоличествоКатегории = 0;
			КонецЕсли;
			СтатистикаКатегорий.Вставить(СтрокаДанных.Категория, КоличествоКатегории + 1);
		КонецЕсли;
	КонецЦикла;
	ТЗ.Сортировать("ИдентификаторХаоса"); //сортировать в случайном порядке
	ДанныеОбученияОбщая = ТЗ.СкопироватьКолонки();
	ДанныеТестированияОбщая = ТЗ.СкопироватьКолонки();
	//от каждой категории в процентном соотношении взять часть на обучение и часть на тест
	//если процент теста = 0, тогда собираетс одна выборка и обучение будет проходить без валидации
	//обучение без валидации допустимо для задачи классификации
	Для каждого Категория из СтатистикаКатегорий Цикл
		КоличествоДляТеста = Окр(Категория.Значение / 100 * Классификатор.ПроцентТеста);
		СтрокиКатегории = ТЗ.НайтиСтроки(Новый Структура("Категория", Категория.Ключ));
		Для Сч = 0 По СтрокиКатегории.Количество()-1 Цикл
			СтрокаКатегории = СтрокиКатегории[Сч];
			Если Сч < КоличествоДляТеста-1 Тогда
				НоваяСтрока = ДанныеТестированияОбщая.Добавить();
			Иначе
				НоваяСтрока = ДанныеОбученияОбщая.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКатегории);
		КонецЦикла;
	КонецЦикла;
	ДанныеОбученияОбщая.Сортировать("ИдентификаторХаоса");
	ДанныеТестированияОбщая.Сортировать("ИдентификаторХаоса");
	МассивТекстаОбучения = Новый Массив;
	МассивТекстаТестирования = Новый Массив;
	ШаблонЗаписи = "%1" + Символы.Таб + "%2";
	Для каждого СтрокаТЗ из ДанныеОбученияОбщая Цикл
		МассивТекстаОбучения.Добавить(СтрШаблон(ШаблонЗаписи, СтрокаТЗ.Сообщение, СтрокаТЗ.Категория));
	КонецЦикла;
	Для каждого СтрокаТЗ из ДанныеТестированияОбщая Цикл
		МассивТекстаТестирования.Добавить(СтрШаблон(ШаблонЗаписи, СтрокаТЗ.Сообщение, СтрокаТЗ.Категория));
	КонецЦикла;
	Результат = Новый Структура;
	Результат.Вставить("ТекстОбучения", СтрСоединить(МассивТекстаОбучения, Символы.ПС));
	Результат.Вставить("ТекстТестирования", СтрСоединить(МассивТекстаТестирования, Символы.ПС));
	Возврат Результат;
КонецФункции

// Функция - Очистить строку
// Оставляет в строке только символы из функции ДопустимыеСимволы(), а так же убирает стоп-слова
//
// Параметры:
//  Текст		 - Строка	 - очищаемый текст
//  СтопСлова	 - Массив	 - массив стоп-слов в нижнем регистре
// 
// Возвращаемое значение:
//  Строка - очищенная строка
//
Функция ОчиститьСтроку(Текст, СтопСлова)
	ОдинПробел = " ";
	ДваПробела = "  ";
	ДопустимыеСимволы = ДопустимыеСимволы();
	Текст_НРег = НРег(Текст);
	МассивТекста = Новый Массив;
	Для Сч = 1 по СтрДлина(Текст_НРег) Цикл
		_Символ = Сред(Текст_НРег, Сч, 1);
		Если НЕ СтрНайти(ДопустимыеСимволы, _Символ) Тогда
			_Символ = ОдинПробел;
		КонецЕсли;
		МассивТекста.Добавить(_Символ);
	КонецЦикла;
	НовыйТекст = СтрСоединить(МассивТекста);
	МассивТекста.Очистить();
	Пока СтрНайти(НовыйТекст, ДваПробела) Цикл
		НовыйТекст = СтрЗаменить(НовыйТекст, ДваПробела, ОдинПробел);
	КонецЦикла;
	Для каждого Слово из СтрРазделить(НовыйТекст, " ") Цикл
		Если СтопСлова.Найти(Слово) = Неопределено Тогда
			МассивТекста.Добавить(Слово);
		КонецЕсли;
	КонецЦикла;
	Возврат СокрЛП(СтрСоединить(МассивТекста, " "));
КонецФункции

// Функция - Нормальные формы текстов
// Превращает каждый элемент входящего массива в лемматизированный вид с добавлением вариантов лемм. Например строка:
//		В коллекции ss23 был указан состав как "100% Полиуретан (ПУ)", сейчас изменился. Указан корректно? Прошу прислать фото реального изделия.
// Будет конвертирована в:
//		в коллекция ss23 быть указанный указывать состав как 100 полиуретан ПУ сейчас изменяться указанный указывать корректно корректный просить проша присылать фото реальный изделие
//
// Параметры:
//  МассивТекстов	 - Массив	 - массив элементов типа Строка
//  СтопСлова	 - Массив	 - массив слов в нижнем регистре, которые необходимо удалить из обучения и предсказания
// 
// Возвращаемое значение:
//  Массив - массив элементов типа Строка
//
Функция НормальныеФормыТекстов(МассивТекстов, СтопСлова, Лемматизация = Истина) Экспорт
	МассивНормальныхФорм = Новый Массив;
	//очистить тексты от лишних символов
	Для каждого Текст из МассивТекстов Цикл
		ЧистаяСтрока = ОчиститьСтроку(Текст, СтопСлова);
		МассивНормальныхФорм.Добавить(ЧистаяСтрока);
	КонецЦикла;
	Если НЕ Лемматизация Тогда
		Возврат МассивНормальныхФорм;
	КонецЕсли;
	//лемматизировать
	ТекстДляЛемматизации = СтрСоединить(МассивНормальныхФорм, символы.ПС);
	ИмяФайла_Вход = ПолучитьИмяВременногоФайла("txt");
	ИмяФайла_Выход = ПолучитьИмяВременногоФайла("txt");
	ЗаписатьТекстВФайл(ТекстДляЛемматизации, ИмяФайла_Вход);
	МассивКоманды = Новый Массив;
	МассивКоманды.Добавить("mystem"); //морфологический анализатор текста от яндекса https://yandex.ru/dev/mystem/ 
	МассивКоманды.Добавить("-l -c"); //-l выводить только леммы слов, -c каждую строку отдельно
	МассивКоманды.Добавить(ИмяФайла_Вход); //входные тексты, которые нужно лемматизировать
	МассивКоманды.Добавить(ИмяФайла_Выход); //результаты
	ТекстКоманды = СтрСоединить(МассивКоманды, " ");
	ЗапуститьПриложение(ТекстКоманды,, Истина);
	Чтение = Новый ЧтениеТекста(ИмяФайла_Выход, КодировкаТекста.UTF8);
	ТекстЛемматизированный = Чтение.Прочитать();
	Чтение.Закрыть();
	УдалитьФайлы(ИмяФайла_Вход);
	УдалитьФайлы(ИмяФайла_Выход);
	МассивНормальныхФорм.Очистить();
	Для каждого Текст из СтрРазделить(ТекстЛемматизированный, Символы.ПС) Цикл
		МассивНормальныхФорм.Добавить(ОчиститьСтроку(Текст, СтопСлова));
	КонецЦикла;
	Возврат МассивНормальныхФорм;
КонецФункции

Процедура ЗаписатьТекстВФайл(Текст, ИмяФайла)
	//по умолчанию сохраняется кодировка utf-8-bom, а надо просто utf-8
	Запись = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.ANSI);
	Запись.Закрыть();
	Запись= Новый ЗаписьТекста(ИмяФайла,,, Истина, Символы.ПС);
	Запись.Записать(Текст);
	Запись.Закрыть();
КонецПроцедуры

// Процедура - Обучить модель
// Создает/заменяет файл модели обучения (нейросети) (реквизит ПутьФайлаМоделиОбучения классификатора) по заготовленному набору данных из функции ПолучитьНаборыДанныхОбучения 
//
// Параметры:
//  Классификатор	 - СправочникСсылка.КлассификацияТекста	 - ссылка на классификатор
//
Процедура ОбучитьМодель(Классификатор) Экспорт
	ЭлементНайден = Ложь;
	Если Классификатор = Справочники.КлассификацияТекста.СообщенияЧатаЗаявокНаЛН Тогда
		ЭлементНайден = Истина;
	КонецЕсли;
	Если НЕ ЭлементНайден Тогда
		ВызватьИсключение "Обучить модель возможно только для предопределенного элемента справочника КлассификацияТекста, т.к. необходимо программирование под каждый кейс";
	КонецЕсли;
	СтруктураТекстов = ПолучитьНаборыДанныхОбучения(Классификатор);
	ПутьФайлаМоделиОбучения = Классификатор.ПутьФайлаМоделиОбучения;
	ИмяФайла_Обучение = ПолучитьИмяВременногоФайла("csv");
	ИмяФайла_Тест = ПолучитьИмяВременногоФайла("csv");
	ИмяФайла_Колонки = ПолучитьИмяВременногоФайла("csv");
	ЗаписатьТекстВФайл(СтруктураТекстов.ТекстОбучения, ИмяФайла_Обучение);
	ЗаписатьТекстВФайл(СтруктураТекстов.ТекстТестирования, ИмяФайла_Тест);
	ЗаписатьТекстВФайл("0	Text
	|1	Label", ИмяФайла_Колонки);
	МассивПутьКМодели = СтрРазделить(ПутьФайлаМоделиОбучения, "\");
	МассивПутьКМодели.Удалить(МассивПутьКМодели.ВГраница());
	РабочийКаталог = СтрСоединить(МассивПутьКМодели, "\");
	МассивКоманда = Новый Массив;
	МассивКоманда.Добавить("catboost"); //само приложение, путь к его директории должен быть на сервере указан в переменной среды PATH
	МассивКоманда.Добавить("fit"); //функция обучения модели
	МассивКоманда.Добавить(СтрШаблон("--model-file %1", ПутьФайлаМоделиОбучения)); //путь к файлу модели
	МассивКоманда.Добавить(СтрШаблон("--learn-set %1", ИмяФайла_Обучение)); //файл набора данных для обучения, основной (большой)
	Если НЕ ПустаяСтрока(СтруктураТекстов.ТекстТестирования) Тогда //данные параметры доступны только при наличии валидационного набора данных
		МассивКоманда.Добавить(СтрШаблон("--test-set %1", ИмяФайла_Тест)); //файл набора данных для тестирования функцией потерь, второстепенный (маленький)
		МассивКоманда.Добавить("--use-best-model"); //сохранять все деревья решений до конца обучения и выбрать самую удачную комбинацию
	КонецЕсли;
	МассивКоманда.Добавить(СтрШаблон("--column-description %1", ИмяФайла_Колонки)); //файл описания колонок
	МассивКоманда.Добавить("--dictionaries ""Word"""); //настройка использования словарей. Необходимо для классификации текста
	МассивКоманда.Добавить("--feature-calcers ""BoW"""); //настройка Bag of words для классификации https://catboost.ai/en/docs/references/text-processing__feature_calcers
	МассивКоманда.Добавить("--tokenizers ""Tok[lemmatizing=True]"""); //настройка токинезации текста с лемматизацией (приведением в нормальную форму)
	МассивКоманда.Добавить("--loss-function MultiClass"); //функция потерь Nulticlass. Основная из нескольких функций, которая умеет в классификацию
	МассивКоманда.Добавить("--od-wait=50"); //сколько итераций ошибка функции потерь должна НЕ уменьшаться, чтобы остановить обучение. Необходимо для предотвращения переобучения
	МассивКоманда.Добавить("--iterations 5000"); //максимальное число итераций, если od-wait не сработал
	ТекстКоманды = СтрСоединить(МассивКоманда, " ");
	ЗапуститьПриложение(ТекстКоманды, РабочийКаталог, Истина); //может занимать длительное время
	УдалитьФайлы(ИмяФайла_Обучение);
	УдалитьФайлы(ИмяФайла_Тест);
	УдалитьФайлы(ИмяФайла_Колонки);
	КлассификаторОбъект = Классификатор.ПолучитьОбъект();
	КлассификаторОбъект.КоличествоПоследнегоОбучения = СтрЧислоВхождений(СтруктураТекстов.ТекстОбучения, Символы.ПС) + СтрЧислоВхождений(СтруктураТекстов.ТекстТестирования, Символы.ПС);
	КлассификаторОбъект.Записать();
КонецПроцедуры

// Функция - Получить категорию сообщений
// Возвращает 
//
// Параметры:
//  МассивТекстов	 - Массив	 - Массив элементов типа Строка, которые необходимо категоризировать
//  Классификатор	 - СправочникСсылка.КлассификацияТекста	 - ссылка на используемый для анализа классификатор
// 
// Возвращаемое значение:
//  Массив - элементы типа СправочникСсылка.КлассификацияТекста_Категории, по индексам совпадает с входящим массивом
//
Функция ПолучитьКатегориюСообщений(МассивТекстов, Классификатор) Экспорт
	ЭлементНайден = Ложь;
	Если Классификатор = Справочники.КлассификацияТекста.СообщенияЧатаЗаявокНаЛН Тогда
		ЭлементНайден = Истина;
	КонецЕсли;
	Если НЕ ЭлементНайден Тогда
		ВызватьИсключение "Обучить модель возможно только для предопределенного элемента справочника КлассификацияТекста, т.к. необходимо программирование под каждый кейс";
	КонецЕсли;
	Результат = Новый Массив;
	Если НЕ ЗначениеЗаполнено(СтрСоединить(МассивТекстов)) Тогда
		Для каждого Элемент из МассивТекстов Цикл
			Результат.Добавить(Справочники.КлассификацияТекста_Категории.Другое);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;
	СтопСлова = СтрРазделить(Классификатор.СтопСлова, Символы.ПС);
	НормальныеФормы = НормальныеФормыТекстов(МассивТекстов, СтопСлова);
	ИмяФайла_Входящий = ПолучитьИмяВременногоФайла("csv");
	ИмяФайла_Колонки = ПолучитьИмяВременногоФайла("csv");
	ИмяФайла_Ответ = ПолучитьИмяВременногоФайла("csv");
	ЗаписатьТекстВФайл(СтрСоединить(НормальныеФормы, Символы.ПС), ИмяФайла_Входящий);
	ЗаписатьТекстВФайл("0	Text", ИмяФайла_Колонки);
	МассивПутьКМодели = СтрРазделить(Классификатор.ПутьФайлаМоделиОбучения, "\");
	МассивПутьКМодели.Удалить(МассивПутьКМодели.ВГраница());
	РабочийКаталог = СтрСоединить(МассивПутьКМодели, "\");
	МассивКоманда = Новый Массив;
	МассивКоманда.Добавить("catboost");
	МассивКоманда.Добавить("calc");
	МассивКоманда.Добавить(СтрШаблон("--input-path %1", ИмяФайла_Входящий));
	МассивКоманда.Добавить(СтрШаблон("--cd %1", ИмяФайла_Колонки));
	МассивКоманда.Добавить(СтрШаблон("-o %1", ИмяФайла_Ответ));
	МассивКоманда.Добавить("--prediction-type Class");
	МассивКоманда.Добавить(СтрШаблон("-m %1", Классификатор.ПутьФайлаМоделиОбучения));
	ТекстКоманды = СтрСоединить(МассивКоманда, " ");
	ЗапуститьПриложение(ТекстКоманды, РабочийКаталог, Истина); //может занимать длительное время
	Чтение = Новый ЧтениеТекста(ИмяФайла_Ответ, КодировкаТекста.UTF8);
	ТекстОтвета = Чтение.Прочитать();
	Чтение.Закрыть();
	МассивОтветов = СтрРазделить(ТекстОтвета, Символы.ПС);
	Для Сч = 1 по МассивТекстов.Количество() Цикл
		СтрокаОтвета = МассивОтветов[Сч];
		ИмяКатегории = СтрРазделить(СтрокаОтвета, Символы.Таб)[1];
		Попытка
			Категория = Справочники.КлассификацияТекста_Категории[ИмяКатегории];
		Исключение
			Категория = Справочники.КлассификацияТекста_Категории.Другое;
		КонецПопытки;
		Результат.Добавить(Категория);
	КонецЦикла;
	УдалитьФайлы(ИмяФайла_Входящий);
	УдалитьФайлы(ИмяФайла_Колонки);
	УдалитьФайлы(ИмяФайла_Ответ);
	Возврат Результат;
КонецФункции
